tutorials/BubbleCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     LSThermalPhaseChangeFlow;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      2;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       .005;

functions
{
  

    // ************************************************ //
    // **** Pressure profiles along sampling lines **** //
    // ************************************************ //
    pressure_profiles
    {
        type                sets;
        libs                ("libsampling.so");
        writeControl        adjustableRunTime;
        writeInterval       10;
        setFormat           raw;
        interpolationScheme cellPointFace;

        sets
        (
            line_x_axis
            {
                type       midPointAndFace;
                axis       distance;
                start      (0 0 1);
                end        (1 0 1);
            }
            line_xy_45
            {
                type       midPointAndFace;
                axis       distance;
                start      (0 0 1);
                end        (1 1 1);
            }
            line_y_axis
            {
                type       midPointAndFace;
                axis       distance;
                start      (0 0 1);
                end        (0 1 1);
            }
            line_z_axis
            {
                type       midPointAndFace;
                axis       distance;
                start      (0 0 1);
                end        (0 0 0);
            }
            line_xz_45
            {
                type       midPointAndFace;
                axis       distance;
                start      (0 0 1);
                end        (1 0 0);
            }
            line_yz_45
            {
                type       midPointAndFace;
                axis       distance;
                start      (0 0 1);
                end        (0 1 0);
            }
            line_xyz_45
            {
                type       midPointAndFace;
                axis       distance;
                start      (0 0 1);
                end        (1 1 0);
            }
        );


        fields
        (
            p
        );
    }

    // ************************************************ //
    // **** monitor of min/max values ofvelocity magnitude **** //
    // ************************************************ //

    minMaxMagnitude
    {
        type            fieldMinMax;
        libs            ("libfieldFunctionObjects.so");

        writeControl    timeStep;
        writeInterval   1;

        write           true;
        log             false;
        mode            magnitude;
        fields          ( U );
    }


}




// ************************************************************************* //


// ************************************************************************* //
