tutorials/BubbleCase/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

D XM;


vertices
(
    (0 0 0) //0
    (1 0 0) //1
    (1 1 0) //2
    (0 1 0) //3
    (0 0 1) //4
    (1 0 1)  //5
    (1 1 1) //6
    (0 1 1) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($D $D $D) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    symmetry symmetryPlanes 
    (
        (0 4 7 3)
        (4 5 6 7)
        (1 5 4 0)
    )
    
    
    patch FarStream
    (
        (6 2 1 5)
        (7 6 2 3)
        (0 3 2 1)
    )



);

mergePatchPairs
(
);



// ************************************************************************* //
