tutorials/BubbleCase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    
    
);

regions
(
    sphereToCell
    {
        origin (0 0 1);
        radius .5;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            
            
        );
    }
    
//         cylinderToCell
//     {
//         p1 (0 0 2);
//         p2 (0 0 0);
// 
//         radius 1;
//         fieldValues
//         (
//             volScalarFieldValue alpha.water 0
//             
//             
//         );
//     }

);

// ************************************************************************* //
